app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("created_at", "updated_at", "user_id", "content") VALUES('2012-01-05 17:46:42', '2012-01-05 17:46:42', 1, 'test message')
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save

DELETE FROM "microposts" WHERE "id" = 302
---
  def destroy
    @micropost.destroy