app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "microposts" WHERE ("microposts".user_id = 2) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT * FROM "users" LIMIT 1
SELECT count(*) AS count_all FROM "microposts" WHERE ("microposts".user_id = 2)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('Kevin Cheng', '3cde34b92e71aacf59bb4563332ad5bac19d83dbe7ae2f299c04d7624b33c0ce', 'f2d19d3afa5bfa73295406c7886ceeab416a96c70164138f2646c234acc6532d', '2011-08-22 10:16:21', '2011-08-22 10:16:21', NULL, 'kevin@msn.com')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2011-09-07 13:34:18', "encrypted_password" = 'c908d3124477e909c6499a138cb5c48a13cd32986ab7d90595e95300c9a45cb0', "salt" = '67dabbc84c31a47719069c5640fdb5bc1cb0eb06e878ee750ff68dd54e43beb5' WHERE "id" = 2

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 26
SELECT * FROM "users" WHERE ("users"."id" = 26)

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)